{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-attribute",
    "2": "I-attribute",
    "3": "B-causal",
    "4": "I-causal",
    "5": "B-goal",
    "6": "I-goal",
    "7": "B-identity",
    "8": "I-identity",
    "9": "B-location",
    "10": "I-location",
    "11": "B-occupation",
    "12": "I-occupation",
    "13": "B-policy",
    "14": "I-policy",
    "15": "B-preference",
    "16": "I-preference",
    "17": "B-state",
    "18": "I-state",
    "19": "B-value",
    "20": "I-value"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-attribute": 1,
    "B-causal": 3,
    "B-goal": 5,
    "B-identity": 7,
    "B-location": 9,
    "B-occupation": 11,
    "B-policy": 13,
    "B-preference": 15,
    "B-state": 17,
    "B-value": 19,
    "I-attribute": 2,
    "I-causal": 4,
    "I-goal": 6,
    "I-identity": 8,
    "I-location": 10,
    "I-occupation": 12,
    "I-policy": 14,
    "I-preference": 16,
    "I-state": 18,
    "I-value": 20,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "vocab_size": 119547
}
