{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-ACCOUNTNAME",
    "2": "I-ACCOUNTNAME",
    "3": "B-ACCOUNTNUMBER",
    "4": "I-ACCOUNTNUMBER",
    "5": "B-AGE",
    "6": "I-AGE",
    "7": "B-AMOUNT",
    "8": "I-AMOUNT",
    "9": "B-BIC",
    "10": "I-BIC",
    "11": "B-BITCOINADDRESS",
    "12": "I-BITCOINADDRESS",
    "13": "B-BUILDINGNUMBER",
    "14": "I-BUILDINGNUMBER",
    "15": "B-CITY",
    "16": "I-CITY",
    "17": "B-COMPANYNAME",
    "18": "I-COMPANYNAME",
    "19": "B-COUNTY",
    "20": "I-COUNTY",
    "21": "B-CREDITCARDCVV",
    "22": "I-CREDITCARDCVV",
    "23": "B-CREDITCARDISSUER",
    "24": "I-CREDITCARDISSUER",
    "25": "B-CREDITCARDNUMBER",
    "26": "I-CREDITCARDNUMBER",
    "27": "B-CURRENCY",
    "28": "I-CURRENCY",
    "29": "B-CURRENCYCODE",
    "30": "I-CURRENCYCODE",
    "31": "B-CURRENCYNAME",
    "32": "I-CURRENCYNAME",
    "33": "B-CURRENCYSYMBOL",
    "34": "I-CURRENCYSYMBOL",
    "35": "B-DATE",
    "36": "I-DATE",
    "37": "B-DOB",
    "38": "I-DOB",
    "39": "B-EMAIL",
    "40": "I-EMAIL",
    "41": "B-ETHEREUMADDRESS",
    "42": "I-ETHEREUMADDRESS",
    "43": "B-EYECOLOR",
    "44": "I-EYECOLOR",
    "45": "B-FIRSTNAME",
    "46": "I-FIRSTNAME",
    "47": "B-GENDER",
    "48": "I-GENDER",
    "49": "B-HEIGHT",
    "50": "I-HEIGHT",
    "51": "B-IBAN",
    "52": "I-IBAN",
    "53": "B-IP",
    "54": "I-IP",
    "55": "B-IPV4",
    "56": "I-IPV4",
    "57": "B-IPV6",
    "58": "I-IPV6",
    "59": "B-JOBAREA",
    "60": "I-JOBAREA",
    "61": "B-JOBTITLE",
    "62": "I-JOBTITLE",
    "63": "B-JOBTYPE",
    "64": "I-JOBTYPE",
    "65": "B-LASTNAME",
    "66": "I-LASTNAME",
    "67": "B-LITECOINADDRESS",
    "68": "I-LITECOINADDRESS",
    "69": "B-MAC",
    "70": "I-MAC",
    "71": "B-MASKEDNUMBER",
    "72": "I-MASKEDNUMBER",
    "73": "B-MIDDLENAME",
    "74": "I-MIDDLENAME",
    "75": "B-NEARBYGPSCOORDINATE",
    "76": "I-NEARBYGPSCOORDINATE",
    "77": "B-ORDINALDIRECTION",
    "78": "I-ORDINALDIRECTION",
    "79": "B-PASSWORD",
    "80": "I-PASSWORD",
    "81": "B-PHONEIMEI",
    "82": "I-PHONEIMEI",
    "83": "B-PHONENUMBER",
    "84": "I-PHONENUMBER",
    "85": "B-PIN",
    "86": "I-PIN",
    "87": "B-PREFIX",
    "88": "I-PREFIX",
    "89": "B-SECONDARYADDRESS",
    "90": "I-SECONDARYADDRESS",
    "91": "B-SECRET",
    "92": "I-SECRET",
    "93": "B-SEX",
    "94": "I-SEX",
    "95": "B-SSN",
    "96": "I-SSN",
    "97": "B-STATE",
    "98": "I-STATE",
    "99": "B-STREET",
    "100": "I-STREET",
    "101": "B-TIME",
    "102": "I-TIME",
    "103": "B-URL",
    "104": "I-URL",
    "105": "B-USERAGENT",
    "106": "I-USERAGENT",
    "107": "B-USERNAME",
    "108": "I-USERNAME",
    "109": "B-VEHICLEVIN",
    "110": "I-VEHICLEVIN",
    "111": "B-VEHICLEVRM",
    "112": "I-VEHICLEVRM",
    "113": "B-ZIPCODE",
    "114": "I-ZIPCODE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ACCOUNTNAME": 1,
    "B-ACCOUNTNUMBER": 3,
    "B-AGE": 5,
    "B-AMOUNT": 7,
    "B-BIC": 9,
    "B-BITCOINADDRESS": 11,
    "B-BUILDINGNUMBER": 13,
    "B-CITY": 15,
    "B-COMPANYNAME": 17,
    "B-COUNTY": 19,
    "B-CREDITCARDCVV": 21,
    "B-CREDITCARDISSUER": 23,
    "B-CREDITCARDNUMBER": 25,
    "B-CURRENCY": 27,
    "B-CURRENCYCODE": 29,
    "B-CURRENCYNAME": 31,
    "B-CURRENCYSYMBOL": 33,
    "B-DATE": 35,
    "B-DOB": 37,
    "B-EMAIL": 39,
    "B-ETHEREUMADDRESS": 41,
    "B-EYECOLOR": 43,
    "B-FIRSTNAME": 45,
    "B-GENDER": 47,
    "B-HEIGHT": 49,
    "B-IBAN": 51,
    "B-IP": 53,
    "B-IPV4": 55,
    "B-IPV6": 57,
    "B-JOBAREA": 59,
    "B-JOBTITLE": 61,
    "B-JOBTYPE": 63,
    "B-LASTNAME": 65,
    "B-LITECOINADDRESS": 67,
    "B-MAC": 69,
    "B-MASKEDNUMBER": 71,
    "B-MIDDLENAME": 73,
    "B-NEARBYGPSCOORDINATE": 75,
    "B-ORDINALDIRECTION": 77,
    "B-PASSWORD": 79,
    "B-PHONEIMEI": 81,
    "B-PHONENUMBER": 83,
    "B-PIN": 85,
    "B-PREFIX": 87,
    "B-SECONDARYADDRESS": 89,
    "B-SECRET": 91,
    "B-SEX": 93,
    "B-SSN": 95,
    "B-STATE": 97,
    "B-STREET": 99,
    "B-TIME": 101,
    "B-URL": 103,
    "B-USERAGENT": 105,
    "B-USERNAME": 107,
    "B-VEHICLEVIN": 109,
    "B-VEHICLEVRM": 111,
    "B-ZIPCODE": 113,
    "I-ACCOUNTNAME": 2,
    "I-ACCOUNTNUMBER": 4,
    "I-AGE": 6,
    "I-AMOUNT": 8,
    "I-BIC": 10,
    "I-BITCOINADDRESS": 12,
    "I-BUILDINGNUMBER": 14,
    "I-CITY": 16,
    "I-COMPANYNAME": 18,
    "I-COUNTY": 20,
    "I-CREDITCARDCVV": 22,
    "I-CREDITCARDISSUER": 24,
    "I-CREDITCARDNUMBER": 26,
    "I-CURRENCY": 28,
    "I-CURRENCYCODE": 30,
    "I-CURRENCYNAME": 32,
    "I-CURRENCYSYMBOL": 34,
    "I-DATE": 36,
    "I-DOB": 38,
    "I-EMAIL": 40,
    "I-ETHEREUMADDRESS": 42,
    "I-EYECOLOR": 44,
    "I-FIRSTNAME": 46,
    "I-GENDER": 48,
    "I-HEIGHT": 50,
    "I-IBAN": 52,
    "I-IP": 54,
    "I-IPV4": 56,
    "I-IPV6": 58,
    "I-JOBAREA": 60,
    "I-JOBTITLE": 62,
    "I-JOBTYPE": 64,
    "I-LASTNAME": 66,
    "I-LITECOINADDRESS": 68,
    "I-MAC": 70,
    "I-MASKEDNUMBER": 72,
    "I-MIDDLENAME": 74,
    "I-NEARBYGPSCOORDINATE": 76,
    "I-ORDINALDIRECTION": 78,
    "I-PASSWORD": 80,
    "I-PHONEIMEI": 82,
    "I-PHONENUMBER": 84,
    "I-PIN": 86,
    "I-PREFIX": 88,
    "I-SECONDARYADDRESS": 90,
    "I-SECRET": 92,
    "I-SEX": 94,
    "I-SSN": 96,
    "I-STATE": 98,
    "I-STREET": 100,
    "I-TIME": 102,
    "I-URL": 104,
    "I-USERAGENT": 106,
    "I-USERNAME": 108,
    "I-VEHICLEVIN": 110,
    "I-VEHICLEVRM": 112,
    "I-ZIPCODE": 114,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "vocab_size": 119547
}
